# s1 = {1, 2, 3}
# 元素值必须是不可变数据类型
# s1 = {1, 2, 3,[4,5]} # 报错
# print(type(s1))  # <class 'set'>
# print(len(s1))

#  (1) 无序
# s1[0]
#  (2) 唯一特性
# s2 = {1, 2, 3, 3, 3, 2}
# print(s2)  # {1, 2, 3}

# 面试题: 将列表去重
# l = [1, 2, 3, 3, 3, 2,4,3]
# 类型转换：将列表转为集合,再将集合转为列表
# print(list(set(l)))

# (3) 可变类型:  列表和字典
# 内置方法： 添加和删除
# 添加元素
# s3 = {1, 2, 3}
# s3.add(4)
# s3.update({3, 4, 5})
# print(s3)
# l = [1, 2, 3]
# l.extend([3, 4, 5])
# print(l)
# 删除元素

# s3 = {1, 2, 3}
# s3.remove(2)
# s3.discard(2)
# s3.remove(22) # 当删除元素不存在，报错
# s3.discard(22)  # 当删除元素不存在，什么都不发生
# s3.pop()
# print(s3)
# s3.clear()
# print(s3) # set()




