# 案例2:根据用户输入的成绩判断其等级。如果成绩大于等于60分，则输出"及格"，否则输出"不及格"。

# score = float(input("请输入成绩:"))
#
# if score >= 60:
#     print("及格")
# else:
#     print("不及格")


# 案例3: 编写一个程序，判断一个年份是否为闰年。如果是闰年，则输出"是闰年"，否则输出"不是闰年"。闰年的判断条件是能够被4整除但不能被100整除，或者能够被400整除。


# year = int(input("请输入年份:"))
#
# # print(year % 400 == 0 or (year % 4 == 0 and year % 100 != 0))
#
# is_run = year % 400 == 0 or (year % 4 == 0 and year % 100 != 0)
#
# if is_run:
#     print("是闰年")
# else:
#     print(f"{year}不是闰年")

# 案例4:编写一个程序，根据用户输入的三个数字，判断这三个数字是否能够构成一个等边三角形。如果能够构成等边三角形，则输出"能构成等边三角形"，否则输出"不能构成等边三角形"。等边三角形的判断条件是三条边的长度相等。

# num01 = int(input("请输入一个数字:"))
# num02 = int(input("请输入一个数字:"))
# num03 = int(input("请输入一个数字:"))

# if num01 == num02 and num01 == num03
# if num01 == num02 == num03:
#     print("能构成等边三角形")
# else:
#     print("不能构成等边三角形")

# 案例5: 用户输入一个年龄，判断是否符合20-35

# age = int(input("请输入一个年龄:"))
# # if age > 20 and age < 35:
# if 20 < age < 35:
#     print("符合招聘要求")
# else:
#     print("不符合招聘要求")


# 案例6: 输入一个数字，判断是否为偶数

# num = int(input("请输入一个数字:"))
#
# if num % 2 == 0:
#     print("是偶数")
# else:
#     print("是奇数")
